# mass.py
ERROR_MASS_VALUE_TYPE = "Указан неверный тип данный\n\t{value}\nДолжен быть тип int или float"
ERROR_OIL_FIRST_PART_IS_100 = "Указанный процент масла начального ингредиента почти 100%"
ERROR_SPECIAL_PART_IS_100 = "Указанный процент основной части занимает почти 100% всей массы результата"
ERROR_OIL_FIRST_PART_EQU_SPECIAL_PART = "Указанные проценты масла начального ингредиента и основной части почти равны"
ERROR_OIL_FULL_PART_IS_100  = "Указанный процент масла основной части занимает почти 100% всей массы основной части"
ERROR_SPECIAL_PART_IS_0 = "Указанный процент основной части почти равен нулю"

# percent.py
ERROR_NUMERIC_VALUE = "Значение должно быть числового типа"
ERROR_DICT_VALUE = "Значение должно быть словарем"
ERROR_DICT_PARAMETER_VALUE = "Значение параметра {code} в словаре не числового типа - {value}"